var dishes = [
    {
        "name": "Салат из шпината с грецкими орехами и кефиром",
        "ingredients": [
            "Шпинат",
            "Кефир",
            "Сахар",
            "Грецкие орехи",
            "Соль"
        ]
    },
    {
        "name": "Салат с языком, кукурузой, сыром и орехами",
        "ingredients": [
            "Отварной язык",
            "Яйца",
            "Лук репчатый",
            "Консервированная кукуруза",
            "Грецкие орехи",
            "Маслины",
            "Твёрдый сыр",
            "Соль",
            "Черный молотый перец"
        ]
    },
    {
        "name": "Салат с редиской и ананасами \"Колёса любви\"",
        "ingredients": [
            "Куриная грудка",
            "Редиска",
            "Лук красный",
            "Яблоко зеленое",
            "Зелень",
            "Маслины (без косточек)",
            "Ананасы консервированные (шайбами)",
            "Майонез",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Летний салат с баклажанами",
        "ingredients": [
            "Баклажаны",
            "Сладкий перец",
            "Помидоры",
            "Лук",
            "Зелень",
            "Соль",
            "Перец",
            "Майонез",
            "Сметана",
            "Сок лимонный"
        ]
    },
    {
        "name": "Грузинский салат \"Яблоко и перец\"",
        "ingredients": [
            "Яблоки кисло-сладкие",
            "Болгарский перец красный",
            "Свежая петрушка",
            "Сметана",
            "Соль",
            "Сахар",
            "Черный молотый перец"
        ]
    },
    {
        "name": "Салат \" Остряк\" постный",
        "ingredients": [
            "Морковь крупная",
            "Луковица крупная",
            "Соленые огурцы",
            "Фасоль консервированная или вареная (красная)",
            "Чеснок",
            "Зелень",
            "Растительное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Cалат из перловки с овощами",
        "ingredients": [
            "Перловая крупа",
            "Морковь",
            "Помидор",
            "Лук",
            "Огурец",
            "Стебель сельдерея",
            "Зелень петрушки",
            "Растительное масло",
            "Лимон",
            "Соль",
            "Черный молотый перец"
        ]
    },
    {
        "name": "Морковный салат с виноградом",
        "ingredients": [
            "Морковь",
            "Виноград",
            "Лимон",
            "Сметана",
            "Мед",
            "Растительное масло",
            "Грецкие орехи",
            "Зелень петрушки",
            "Соль",
            "Черный молотый перец"
        ]
    },
    {
        "name": "Салат \"Первая зелень\"",
        "ingredients": [
            "Морковь крупная",
            "Яйца",
            "Зеленый лук",
            "Щавель",
            "Крапива",
            "Чеснок (зелень)",
            "Листья одуванчика",
            "Растительное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Овощной салат-ассорти с имбирной заправкой",
        "ingredients": [
            "Капуста",
            "Яблоки",
            "Тыква",
            "Лук",
            "Зелень",
            "Заправка:",
            "Сок половины среднего лимона",
            "Сахар",
            "Оливковое масло",
            "Имбирь тертый",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Теплый овощной салат со стручковой фасолью, морковью, кабачками и баклажанами",
        "ingredients": [
            "Кабачок или цуккини",
            "Баклажаны",
            "Морковь",
            "Стручковая фасоль",
            "Лук",
            "Перец сладкий",
            "Зелень",
            "Чеснок",
            "Помидоры",
            "Специи (любые)",
            "Соль, белый перец",
            "Вода"
        ]
    },
    {
        "name": "Зеленый салат с маслом",
        "ingredients": [
            "Листья зеленого салата",
            "Растительное масло",
            "Уксус",
            "Огурец свежий",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из листьев одуванчика \"Весенний\"",
        "ingredients": [
            "Листики одуванчика",
            "Листья мать-и-мачехи",
            "Листья зеленого салата",
            "Щавель",
            "Огурцы свежие",
            "Лимонный сок",
            "Мед",
            "Сливки",
            "Зеленый лук и укроп.",
            "Соль"
        ]
    },
    {
        "name": "Салат из сельдерея и творога",
        "ingredients": [
            "Сельдерей черешковый",
            "Творог",
            "Яблоки",
            "Грецкие орехи",
            "Молоко",
            "Майонез",
            "Лимонный сок",
            "Соль"
        ]
    },
    {
        "name": "Салат из фенхеля с апельсинами",
        "ingredients": [
            "Апельсины",
            "Фенхель",
            "Зелень петрушки",
            "Уксус винный 0,5 ст.л.",
            "Оливковое масло",
            "Маслины",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из шпината с зеленым луком и соусом из кислого молока",
        "ingredients": [
            "Шпинат",
            "Зеленый лук",
            "Кислое молоко",
            "Растительное масло",
            "Лимонный сок",
            "Яйца",
            "Зелень петрушки",
            "Маслины",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Универсальный салат из красной капусты",
        "ingredients": [
            "Капуста краснокочаная",
            "Морковь",
            "Огурец свежий",
            "Помидоры",
            "Перец сладкий",
            "Лук",
            "Зелень петрушки",
            "Соль"
        ]
    },
    {
        "name": "Салат с киви и пекинской капусты",
        "ingredients": [
            "Киви",
            "Пекинская капуста",
            "Кинза",
            "Кунжут"
        ]
    },
    {
        "name": "Овощной салат из редьки,  сельдерея, помидор",
        "ingredients": [
            "Редька (белая)",
            "Сельдерей черешковый",
            "Кинза",
            "Пекинская капуста",
            "Помидоры",
            "Огурец свежий",
            "Сладкий болгарский перец",
            "Кунжут",
            "Соль",
            "Растительное масло"
        ]
    },
    {
        "name": "Салат огуречный с сельдереем",
        "ingredients": [
            "Огурцы свежие",
            "Сельдерей черешковый",
            "Кинза",
            "Масло горчичное",
            "Соль"
        ]
    },
    {
        "name": "Салат из цветной капусты с помидорами",
        "ingredients": [
            "Цветная капуста (сырая)",
            "Помидоры",
            "Сыр твердых сортов",
            "Чеснок",
            "Кинза (по желанию), укроп.",
            "Для соуса:",
            "Сметана",
            "Соевый соус",
            "Горчица с зернышками",
            "Зеленый лук.",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Кальмары в томатном соусе с сладким перцем и оливками",
        "ingredients": [
            "Кальмары очищенные",
            "Помидоры",
            "Лук красный",
            "Чеснок",
            "Перец сладкий болгарский",
            "Оливки",
            "Маслины",
            "Соус из запеченных перцев",
            "Томатная паста",
            "Сахар",
            "Соль",
            "Овощной бульон",
            "Оливковое масло",
            "Специи :",
            "Сушеный базилик",
            "Сушеный тимьян",
            "Сушеный орегано",
            "Острая паприка копченая",
            "Сладкая паприка"
        ]
    },
    {
        "name": "Салат из пекинской капусты и сельдерея",
        "ingredients": [
            "Пекинская капуста",
            "Сельдерей черешковый",
            "Помидоры",
            "Чеснок",
            "Йогурт",
            "Укроп",
            "Сок лайма",
            "Соль"
        ]
    },
    {
        "name": "Сельдерейно-яичный салат",
        "ingredients": [
            "Сельдерей черешковый",
            "Яйца",
            "Сметана или йогурт",
            "Сыр",
            "Укроп",
            "Чеснок",
            "Салатные листья",
            "Соль"
        ]
    },
    {
        "name": "Коктейль зеленый с пшеницей, огурцом и бананом",
        "ingredients": [
            "Зелень пшеницы",
            "Огурец",
            "Банан",
            "Сельдерей черешковый",
            "Абрикосы",
            "Петрушка, укроп",
            "Вода"
        ]
    },
    {
        "name": "Салат из фасоли с сельдереем",
        "ingredients": [
            "Фасоль",
            "Сельдерей",
            "Лук",
            "Зелень петрушки.",
            "Лимонный сок",
            "Масло горчичное",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат с сельдереем",
        "ingredients": [
            "Яблоко",
            "Сельдерей корневой",
            "Консервированные ананасы",
            "Сыр твердых сортов",
            "Майонез",
            "Грецкие орехи",
            "Зелень укропа и петрушки.",
            "Соль"
        ]
    },
    {
        "name": "Шарлотка \"Роза\"",
        "ingredients": [
            "Бисквит шоколадный:",
            "Яйца",
            "Сахар",
            "Мука",
            "Крахмал",
            "Какао",
            "Цедра апельсина",
            "Бисквит белый:",
            "Яйцо",
            "Яичный белок",
            "Мука",
            "Сахар",
            "Крем:",
            "Сливки 33%",
            "Йогурт персиковый",
            "Сахар",
            "Желатин быстрорастворимый",
            "Ягодное фруктовое пюре (малина+ смородина)",
            "Мармелад (зеленого цвета)",
            "Помадка:",
            "Какао",
            "Сахар",
            "Молоко",
            "Масло сливочное"
        ]
    },
    {
        "name": "Салат из кольраби",
        "ingredients": [
            "Кольраби",
            "Лук красный",
            "Замороженные стручки фасоли или зеленый горох",
            "Кунжутное масло",
            "Винный белый уксус",
            "Соевый соус",
            "Мед"
        ]
    },
    {
        "name": "Луковые вафли с сыром и беконом",
        "ingredients": [
            "Мука",
            "Разрыхлитель",
            "Сахар",
            "Сода",
            "Соль",
            "Молотый перец",
            "Сливочное масло",
            "Яйца",
            "Кислое молоко",
            "Зеленый лук (нарезанный)",
            "Зелень петрушки",
            "Бекон",
            "Сыр"
        ]
    },
    {
        "name": "Овощной хоровац",
        "ingredients": [
            "Баклажаны",
            "Перец болгарский",
            "Помидоры",
            "Чеснок",
            "Соль, молотый черный, красный перец"
        ]
    },
    {
        "name": "Картофельный салат с индейкой и сельдереем",
        "ingredients": [
            "Филе индейки",
            "Картофель",
            "Морковь",
            "Лук репчатый",
            "Помидоры",
            "Сельдерей черешковый",
            "Масло растительное",
            "Майонез",
            "Зелень",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Шоколадно-банановое печенье",
        "ingredients": [
            "Банан",
            "Мука",
            "Разрыхлитель",
            "Какао",
            "Сахар",
            "Ванильный сахар",
            "Сливочное масло",
            "Сахарная пудра",
            "Соль"
        ]
    },
    {
        "name": "Шоколадное печенье с зефиром",
        "ingredients": [
            "Мука",
            "Какао",
            "Сода",
            "Соль",
            "Сливочное масло",
            "Сахар",
            "Яйцо",
            "Молоко",
            "Ванильный сахар",
            "Зефир",
            "Для шоколадной глазури:",
            "Сахар",
            "Масло сливочное растопленное",
            "Какао",
            "Молоко",
            "Ванильный сахар"
        ]
    },
    {
        "name": "Пряный тыквенный кекс с фундуком",
        "ingredients": [
            "Яйца",
            "Сахар",
            "Овсяные хлопья",
            "Апельсин",
            "Морковь",
            "Фундук",
            "Растительное масло",
            "Мука",
            "Разрыхлитель",
            "Мускатный орех",
            "Корица, кардамон",
            "Для соуса:",
            "Тыква",
            "Фундук",
            "Апельсиновый сок",
            "Лимонный сок",
            "Сахар коричневый",
            "Сливочное масло"
        ]
    },
    {
        "name": "Домашнее печенье с растворимым кофе",
        "ingredients": [
            "Масло сливочное",
            "Сахар",
            "Кофе растворимый",
            "Какао-порошок",
            "Мука"
        ]
    },
    {
        "name": "Печенье \"Сказка\"",
        "ingredients": [
            "Сливочное масло",
            "Яичные желтки",
            "Сахарная пудра",
            "Мука",
            "Разрыхлитель",
            "Орехи арахис."
        ]
    },
    {
        "name": "Печенье \"палочки апельсино ореховые\"",
        "ingredients": [
            "Сливочное масло",
            "Сахарная пудра",
            "Цедра одного апельсина.",
            "Мука",
            "Крахмал кукурузный",
            "Соль",
            "Апельсиновый сок",
            "Орехи фундук",
            "Для украшения:",
            "Горький шоколад"
        ]
    },
    {
        "name": "Бесподобные \"Блонди\" с овсянкой и шоколадом",
        "ingredients": [
            "Мука",
            "Разрыхлитель",
            "Кардамон молотый",
            "Сахар коричневый",
            "Сливочное масло",
            "Ванильный сахар",
            "Яйца",
            "Мед ",
            "Овсяные хлопья",
            "Шоколад",
            "Соль"
        ]
    },
    {
        "name": "Тыквенно-апельсиновый торт",
        "ingredients": [
            "Тесто:",
            "Мука",
            "Разрыхлитель",
            "Корица",
            "Яйца",
            "Сахар",
            "Растительное масло",
            "Тыква (мякоть)",
            "Цедра одного апельсина.",
            "Орехи",
            "Соль",
            "Перец",
            "Крем:",
            "Сметана",
            "Сахарная пудра",
            "Сахар",
            "Сок одного апельсина."
        ]
    },
    {
        "name": "Солнечная запеканка из тыквы и творога",
        "ingredients": [
            "Тыква",
            "Творог (любой жирности)",
            "Яйцо куриное",
            "Сахар",
            "Крупа манная",
            "Изюм"
        ]
    },
    {
        "name": "Салат из тыквы, яблок и кураги",
        "ingredients": [
            "Тыква",
            "Яблоко",
            "Курага",
            "Отруби",
            "Мед",
            "Уксус яблочный",
            "Кунжут"
        ]
    },
    {
        "name": "Картофельные мини-запеканки с курицей, грибами и сыром",
        "ingredients": [
            "Картофель отварной",
            "Сливочное масло",
            "Яйца",
            "Мясо куриное отварное",
            "Сыр",
            "Сливки 20%",
            "Зелень свежая",
            "Грибы маринованные",
            "Пармезан",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Куриные ножки в тыквах",
        "ingredients": [
            "Тыковки сорта «баттернат»",
            "Куриные голени",
            "Лук-порей",
            "Курага",
            "Рис",
            "Чеснок",
            "Растительное масло",
            "Сливочное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Котлетки с баклажанами",
        "ingredients": [
            "Баклажаны",
            "Мясной фарш (свинина, курица или ассорти)",
            "Яйца",
            "Панировочные сухари",
            "Сыр твердый",
            "Зелень петрушки",
            "Масло растительное",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Запеканка с курицей и тыквой",
        "ingredients": [
            "Куриная грудка",
            "Тыква",
            "Тыквенные семечки",
            "Базилик сухой",
            "Майоран",
            "Растительное масло",
            "Чеснок",
            "Сыр Дор Блю",
            "Сыр Пармезан",
            "Соль"
        ]
    },
    {
        "name": "Салат с грецкими орехами, салатом рокет и апельсином",
        "ingredients": [
            "Апельсины",
            "Грецкие орехи",
            "Кресс-салат",
            "Салат рокет",
            "Уксус бальзамический",
            "Масло растительное",
            "Соль"
        ]
    },
    {
        "name": "Фрукты в чайном желе",
        "ingredients": [
            "Зеленый чай",
            "Сахар",
            "Лимон",
            "Желатин",
            "Банан",
            "Апельсин",
            "Виноград"
        ]
    },
    {
        "name": "Салат из свеклы и апельсина",
        "ingredients": [
            "Свекла",
            "Апельсин",
            "Зелень петрушки",
            "Растительное масло",
            "Уксус",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Овощной салат \"Цветной\"",
        "ingredients": [
            "Пекинская капуста",
            "Огурцы",
            "Морковь",
            "Кукуруза",
            "Листовой салат",
            "Растительное масло",
            "Соль"
        ]
    },
    {
        "name": "Салат из помидоров и ржаного хлеба",
        "ingredients": [
            "Помидоры",
            "Ржаной хлеб",
            "Лук",
            "Растительное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из кальмаров и сладкого перца",
        "ingredients": [
            "Кальмары",
            "Сладкий болгарский перец",
            "Лук",
            "Растительное масло",
            "Уксус",
            "Красный острый перец",
            "Соль"
        ]
    },
    {
        "name": "Рыбный салат из минтая",
        "ingredients": [
            "Филе минтая",
            "Морковь",
            "Зелень укропа",
            "Майонез",
            "Соль"
        ]
    },
    {
        "name": "Салат из свеклы, селедки и яблок",
        "ingredients": [
            "Свекла",
            "Филе селедки",
            "Зеленое яблоко",
            "Лук",
            "Растительное масло",
            "Зерновая горчица",
            "Уксус",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из пекинской капусты и помидоров",
        "ingredients": [
            "Пекинская капуста",
            "Помидоры",
            "Листовой салат",
            "Зелень петрушки",
            "Растительное масло",
            "Соль"
        ]
    },
    {
        "name": "Салат с рукколой и яйцами",
        "ingredients": [
            "Яйца",
            "Руккола",
            "Сметана",
            "Лимонный сок",
            "Кедровые орехи",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат с корнем сельдерея и яблоком",
        "ingredients": [
            "Корень сельдерея",
            "Яблоко",
            "Огурцы",
            "Перец болгарский (красный)",
            "Красный сладкий салатный лук (можно заменить репчатым)",
            "Зелень укропа и петрушки.",
            "Для заправки:",
            "Оливковое или растительное масло",
            "Соль"
        ]
    },
    {
        "name": "Салат из корня сельдерея и винограда",
        "ingredients": [
            "Корень сельдерея",
            "Яблоко",
            "Орехи грецкие",
            "Сметана",
            "Виноград",
            "Соль"
        ]
    },
    {
        "name": "Баклажаны \"Остатки сладки\"",
        "ingredients": [
            "Баклажаны",
            "Перец сладкий",
            "Перец острый",
            "Лук",
            "Растительное масло",
            "Уксус",
            "Зелень",
            "Чеснок",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из рыбы, листового салата \"Кочан капусты\"",
        "ingredients": [
            "Рыба зубатка горячего копчения (горбуша или треска)",
            "Сыр колбасный копченный",
            "Шампиньоны консервированные",
            "Рис",
            "Листовой салат",
            "Яйца (вареные)",
            "Лук репчатый",
            "Майонез",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Слоеные валованы с творогом",
        "ingredients": [
            "Готовое слоеное тесто",
            "Творог",
            "Сметана ",
            "Зелень ",
            "Чеснок, соль, перец"
        ]
    },
    {
        "name": "Слойки с инжиром",
        "ingredients": [
            "Слоеное тесто",
            "Мед",
            "Инжир",
            "Грецкие орехи"
        ]
    },
    {
        "name": "Тыква в слоеном тесте",
        "ingredients": [
            "Подсолнечное масло рафинированное",
            "Тесто слоеное дрожжевое",
            "Сахар-песок",
            "Корица молотая",
            "Тыква",
            "Мука пшеничная",
            "Яйцо куриное"
        ]
    },
    {
        "name": "Форель в слоеном тесте",
        "ingredients": [
            "Кусочек форели",
            "Слоеное бездрожжевое тесто",
            "Растительное масло",
            "Яйцо",
            "Соль, специи"
        ]
    },
    {
        "name": "Пирог из слоеного теста с сыром и баклажаном",
        "ingredients": [
            "Слоеное тесто",
            "Сыр",
            "Баклажаны",
            "Помидоры",
            "Базилик свежий",
            "Оливковое масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Пирог со спаржей",
        "ingredients": [
            "Слоеное тесто",
            "Мука",
            "Сыр",
            "Спаржа",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат с морковью и чечевицей",
        "ingredients": [
            "Оливковое масло",
            "Лук",
            "Чеснок",
            "Морковь",
            "Болгарский сладкий перец (желтый)",
            "Тмин",
            "Кориандр молотый",
            "Чечевица",
            "Куриный бульон",
            "Курага",
            "Изюм",
            "Свежая кинза (нарезанная)",
            "Зелень петрушки",
            "Соль"
        ]
    },
    {
        "name": "Салат с морковью и кукурузой",
        "ingredients": [
            "Кукуруза",
            "Морковь",
            "Помидор",
            "Зеленый острый перец",
            "Зеленый лук",
            "Кинза или петрушка",
            "Чеснок",
            "Оливковое масло",
            "Винный уксус",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из кабачков и моркови",
        "ingredients": [
            "Цуккини",
            "Кабачок",
            "Морковь",
            "Красный лук",
            "Чеснок",
            "Оливковое масло",
            "Белый винный уксус",
            "Лимонный сок",
            "Мед",
            "Свежая петрушка",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Кальмары тушеные с луком и морковью",
        "ingredients": [
            "Тушка кальмара",
            "Морковь",
            "Лук репчатый",
            "Растительное масло ",
            "Чеснок",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Cалат с фасолью и морковью",
        "ingredients": [
            "Фасоль ",
            "Морковь",
            "Лук репчатый",
            "Зелень петрушки",
            "Корень петрушки",
            "Лимонный сок",
            "Оливковое масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат с жареной морковью",
        "ingredients": [
            "Морковь ",
            "Сыр (типа Феты)— 100 г.",
            "Перец болгарский",
            "Грецкие орехи",
            "Руккола или листовой салат",
            "Лимон ",
            "Масло растительное",
            "Лук репчатый красный",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Морковная закуска",
        "ingredients": [
            "Морковь",
            "Ветчина Прошутто",
            "Растительное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Спящая красавица\"",
        "ingredients": [
            "Морковь",
            "Изюм",
            "Грецкие орехи",
            "Апельсин"
        ]
    },
    {
        "name": "Салат из репы",
        "ingredients": [
            "Репа (средняя)",
            "Лук",
            "Растительное масло или майонез",
            "Соль, специи"
        ]
    },
    {
        "name": "Салат с кольраби и репой",
        "ingredients": [
            "Кольраби",
            "Репа",
            "Сок лайма",
            "Мед",
            "Кунжутное масло",
            "Зеленый лук",
            "Соль",
            "Черный молотый перец"
        ]
    },
    {
        "name": "Репа фаршированная",
        "ingredients": [
            "Репы",
            "Грибы белые",
            "Лук",
            "Сливочное масло",
            "Мука",
            "Яйцо",
            "Зелень",
            "Сухари молотые",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Камбала с морковью",
        "ingredients": [
            "Морковь",
            "Оливковое масло",
            "Филе камбалы",
            "Мед",
            "Горчица",
            "Зелень петрушки",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Камбала со шпинатом и паприкой",
        "ingredients": [
            "Шпинат",
            "Камбала",
            "Лук",
            "Сливочное масло или маргарин",
            "Мука",
            "Мускатный орех",
            "Молоко",
            "Сыр пармезан",
            "Паприка",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Камбала, запеченная с помидорами",
        "ingredients": [
            "Камбала ",
            "Помидоры ",
            "Сок лимона",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат из сельдерея",
        "ingredients": [
            "Яблоки",
            "Сельдерей (пучок)",
            "Мята свежая",
            "Орехи",
            "Сок лимонный",
            "Оливковое масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Море вкуса\"",
        "ingredients": [
            "Мидии",
            "Авокадо",
            "Свежий огурец",
            "Груша зелёная",
            "Яйца перепелиные",
            "Соус любой.",
            "Зелень",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Ландыш серебристый...\"",
        "ingredients": [
            "Рыбная консерва в собственном соку",
            "Грибы консервированные",
            "Яйца",
            "Зеленый лук",
            "Лук",
            "Морковь",
            "Майонез",
            "Растительное масло",
            "Укроп",
            "Петрушка",
            "Лист красной капусты",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Итальянский салат с морепродуктами",
        "ingredients": [
            "Кальмары ",
            "Мидии",
            "Зелень",
            "Чеснок",
            "Лимонный сок",
            "Горький перец",
            "Оливковое масло",
            "Соль"
        ]
    },
    {
        "name": "Салат из копченой горбуши",
        "ingredients": [
            "Горбуша горячего копчения",
            "Картофель",
            "Лук",
            "Оливковое масло",
            "Болгарский красный перец",
            "Килька пряного посола",
            "Зеленый лук"
        ]
    },
    {
        "name": "Салат \"Филиппинский \"",
        "ingredients": [
            "Авокадо",
            "Яблоко зеленое",
            "Тунец в собственном соку",
            "Сыр пармезан",
            "Лимон",
            "Майонез",
            "Несколько веточек укропа и пару перышков зеленого лука.",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Розовый вечер\"",
        "ingredients": [
            "Крабовые палочки",
            "Авокадо",
            "Яблоко зеленое",
            "Сыр пармезан",
            "Яйца",
            "Помидоры",
            "Зелень",
            "Майонез",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Рандеву\"",
        "ingredients": [
            "Кукуруза консервированная",
            "Помидоры черри",
            "Огурцы свежие",
            "Красный лук",
            "Сыр",
            "Креветки (очищенные)",
            "Растительное масло",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Пина-Колада\"",
        "ingredients": [
            "Филе куриное",
            "Сыр твердый",
            "Шампиньоны (консервированные)",
            "Горошек зеленый (консервированный)",
            "Ананас консервированный",
            "Орехи кешью",
            "Сметана",
            "Горчица (французская)",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Тайный приворот\"",
        "ingredients": [
            "Яйца",
            "Свежий огурец",
            "Лук",
            "Сельдерей (корень)",
            "Пекинская капуста",
            "Орехи грецкие",
            "Помидоры черри",
            "Яйца перепелиные",
            "Майонез",
            "Слабосоленая красная рыба"
        ]
    },
    {
        "name": "Салат \"Пикантный\"",
        "ingredients": [
            "Огурец свежий",
            "Мясо свинина",
            "Лук репчатый",
            "Сахар",
            "Масло растительное",
            "Соевый соус",
            "Соль",
            "Черный и красный острый перец"
        ]
    },
    {
        "name": "Салат из говяжьего сердца \"Загадка\"",
        "ingredients": [
            "Сердце говяжье",
            "Лук репчатый",
            "Майонез",
            "Салатные листья",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат в хлебных стаканчиках",
        "ingredients": [
            "Свежий багет",
            "Куриное мясо",
            "Маринованные огурцы",
            "Свежие шампиньоны",
            "Лук",
            "Сливочное и растительное масло",
            "Майонез",
            "Свежая зелень.",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Лагуна\"",
        "ingredients": [
            "Свежий огурец",
            "Зеленый лук",
            "Укроп",
            "Сыр",
            "Красная икра",
            "Креветки"
        ]
    },
    {
        "name": "Салат \"Пирамида\"",
        "ingredients": [
            "Печень трески",
            "Картофель",
            "Огурцы соленые",
            "Яйца",
            "Яблоко кислое",
            "Сыр",
            "Майонез"
        ]
    },
    {
        "name": "Салат \"Касабланка\"",
        "ingredients": [
            "Креветки",
            "Авокадо",
            "Ананасы консервированные кольцами",
            "Майонез",
            "Коньяк"
        ]
    },
    {
        "name": "Салат \"Фобос\"",
        "ingredients": [
            "Сладкий перец (оранжевый)",
            "Авокадо",
            "Сельдерей",
            "Семга слабосоленая",
            "Сыр",
            "Лимон",
            "Свежая зелень.",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Курица в веснушках\"",
        "ingredients": [
            "Куриные окорочка",
            "Апельсины",
            "Лук",
            "Уксус",
            "Сахар",
            "Майонез"
        ]
    },
    {
        "name": "Салат \"Боярин\"",
        "ingredients": [
            "Свиной язык",
            "Маринованный жемчужный лук",
            "Яйца",
            "Кедровые или грецкие орехи",
            "Для соуса:",
            "Майонез",
            "Сметана",
            "Хрен столовый",
            "Чеснок",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Пасхальный кулич\"",
        "ingredients": [
            "Яйца",
            "Майонез",
            "Растительное масло рафинированное",
            "Чеснок",
            "Картофель",
            "Сыр",
            "Куриная грудка",
            "Морковь",
            "Лук",
            "Помидоры",
            "Сухари панировочные",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Кассиопея\"",
        "ingredients": [
            "Куриная грудка",
            "Кукуруза консервированная",
            "Виноград крупный сладкий",
            "Пекинская капуста",
            "Сыр типа Пармезан",
            "Для соуса:",
            "Йогурт натуральный не сладкий",
            "Майонез",
            "Карри",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Салат \"Сердечная история\"",
        "ingredients": [
            "Куриные сердечки",
            "Морковь",
            "Лук",
            "Лимон",
            "Соевый соус",
            "Растительное масло"
        ]
    },
    {
        "name": "Черемуховый кекс",
        "ingredients": [
            "Яйца",
            "Сахар",
            "Масло сливочное",
            "Мука",
            "Черемуховая мука",
            "Ванильный сахар",
            "Ликер Амаретто",
            "Брусника",
            "Шоколад молочный",
            "Грецкие орехи",
            "Масло сливочное"
        ]
    },
    {
        "name": "Баклажан \"В манто\"",
        "ingredients": [
            "Баклажан (тонкий)",
            "Сыр твердых сортов",
            "Морковь",
            "Чеснок",
            "Мясной фарш",
            "Лук",
            "Яйцо",
            "Растительное масло (рафинированное)",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Жаренный рис с овощами",
        "ingredients": [
            "Растительное блюдо",
            "Морковь или красный сладкий перец",
            "Чеснок",
            "Свежий имбирь",
            "Рис",
            "Зеленый горошек ( можно замороженный)",
            "Зеленый лук",
            "Соевый соус",
            "Семечки кунжута",
            "Мясо любое (говядина, свинина, куриное)",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Сельдерей (корень) жареный",
        "ingredients": [
            "Сельдерей корень",
            "Растительное масло",
            "Лимонный сок",
            "Соль",
            "Зелень"
        ]
    },
    {
        "name": "Салат \"\"Экстрим\"",
        "ingredients": [
            "Брокколи",
            "Грибы",
            "Лук",
            "Яйца",
            "Майонез",
            "Сметана",
            "Горчица",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Хоросет (пряная фруктово-ореховая смесь)",
        "ingredients": [
            "Яблоко",
            "Орехи грецкие (пекан)",
            "Мед (жидкий)",
            "Корица молотая",
            "Красное вино"
        ]
    },
    {
        "name": "Котлеты из чечевицы и булгура",
        "ingredients": [
            "Чечевица",
            "Булгур",
            "Укроп, кинза",
            "Лук репчатый",
            "Чеснок",
            "Соль",
            "Перец",
            "Кунжут"
        ]
    },
    {
        "name": "Кус- кус с баклажанами",
        "ingredients": [
            "Кус-кус",
            "Баклажан",
            "Растительное масло",
            "Болгарский перец",
            "Базилик свежий",
            "Соль"
        ]
    },
    {
        "name": "Запеченные шампиньоны с картошкой",
        "ingredients": [
            "Картошка",
            "Шампиньоны",
            "Сыр",
            "Лук",
            "Масло топленное",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Говядина с чечевицей и курагой",
        "ingredients": [
            "Мякоть говядины",
            "Лук",
            "Морковь",
            "Корица",
            "Курага",
            "Чечевица зеленая",
            "Соль, молотый красный перец"
        ]
    },
    {
        "name": "Суп с булгуром и курицей",
        "ingredients": [
            "Курица",
            "Булгур",
            "Аджика домашняя",
            "Мята сушенная",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Пирог с персиками и шоколадом",
        "ingredients": [
            "Сливочное масло",
            "Сахарная пудра",
            "Яйцо куриное",
            "Сливки 15%",
            "Мука",
            "Для начинки:",
            "Персики",
            "Творожный сыр",
            "Сахарная пудра",
            "Яйцо куриное",
            "Черный шоколад",
            "Для украшения:",
            "Белый и черный шоколад."
        ]
    },
    {
        "name": "Пирог с шоколадной крошкой",
        "ingredients": [
            "Маргарин",
            "Сахар",
            "Яйца",
            "Сметана",
            "Ванильный пудинг",
            "Мука",
            "Разрыхлитель",
            "Шоколадные хлопья"
        ]
    },
    {
        "name": "Печенье \"Подарок к рождеству\"",
        "ingredients": [
            "Яичные белки",
            "Миндаль",
            "Грецкие орехи",
            "Лимонный сок",
            "Сахар",
            "Миндаль для украшения."
        ]
    },
    {
        "name": "Форель радужная, запеченная в духовке",
        "ingredients": [
            "Форель (или любая другая рыба)",
            "Помидор",
            "Лимон",
            "Укроп",
            "Сыр «Российский»",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Торт \"Рождественская бомба\"",
        "ingredients": [
            "Апельсиново-лимонный курд:",
            "Сок лимонный, апельсиновый сок",
            "Апельсиновая цедра",
            "Сахар",
            "Крахмал",
            "Яйца",
            "Бисквит:",
            "Молоко",
            "Ванилин",
            "Сливочное масло",
            "Мука",
            "Какао",
            "Разрыхлитель",
            "Сахар",
            "Яйца",
            "Яичные желтки",
            "Белый шоколадный мусс с ликёром:",
            "Шоколад белый",
            "Сливки 35%",
            "Яичные белки",
            "Желатин",
            "Ликер апельсиновый",
            "Вода"
        ]
    },
    {
        "name": "Корзиночки из теста фило, сыром фета и шпинатом",
        "ingredients": [
            "Корзиночки:",
            "Тесто фило (вытяжное)",
            "Оливковое масло",
            "Начинка:",
            "Шпинат",
            "Сыр фета",
            "Сливки",
            "Фисташки, красная смородина.",
            "Соль",
            "Перец"
        ]
    },
    {
        "name": "Мясное кольцо",
        "ingredients": [
            "Мясной фарш (любой)",
            "Яйцо",
            "Слоеное тесто",
            "Овощная смесь (замороженная)",
            "Чеснок",
            "Лук репчатый",
            "Соль",
            "Перец"
        ]
    }
]

var mongo = require('mongodb');

var Db = mongo.Db,
    Server = mongo.Server;

var server = new Server("localhost", 27017);
var db = new Db('dish', server);

var initFunction = function () {
    db.open(function (err, db) {
        if (err) {
            console.log('не удалось открыть соединение');
        } else {
            db.collection('dishes', function (err, collection) {
                collection.insert(dishes, function (err, result) {});
            });
        }
        db.close();
    });
}

initFunction();